# Создайте класс GuruPython.
# Создайте описание класса, используя докстринги. Введите такую информацию:
# ​​​​​​​Все, кто проходит этот курс, становятся гуру в Python!
# Выведите на экран описание класса GuruPython используя атрибут __doc__.


class GuruPython:
    """Все, кто проходит этот курс, становятся гуру в Python!"""


print(GuruPython.__doc__)
