# Создайте класс Person
# Создайте атрибут name внутри класса, и присвойте ему значение "Vasya"
# Создайте экземпляр класса и назовите его id_1. Не забывайте про скобки у класса.
# Выведите на экран значение атрибута name, который принадлежит экземпляру id_1, используя print()


class Person:
    name = "Vasya"


id_1 = Person()
print(id_1.name)
