# Выведите в консоль следующую строку: \\\'. Попробуйте решить задачу двумя способами.

print("\\\\\\'")
print(r"\\\'")
