# Чтобы расшифровать сообщение, ему необходимо вывести каждый символ на новой строке.
# Ваша задача написать программу, и помочь Алану спасти мир!

print("\n".join(input()))